tap "anomalyco/tap"
tap "homebrew/autoupdate"
tap "oven-sh/bun"
brew "openssl@3"
brew "agent-browser"
brew "ansible"
brew "bat"
brew "biome"
brew "btop"
brew "caddy", restart_service: :changed
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-absorb"
brew "imagemagick"
brew "infisical"
brew "jq"
brew "libpq"
brew "luarocks"
brew "mise"
brew "mole"
brew "neovim"
brew "nmap"
brew "pgcli"
brew "pnpm"
brew "poppler"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "stow"
brew "tmux"
brew "uv"
brew "watchman"
brew "wget"
brew "worktrunk"
brew "yazi"
brew "zoxide"
brew "anomalyco/tap/opencode"
brew "oven-sh/bun/bun"
cask "alt-tab"
cask "codex-app"
cask "docker-desktop"
cask "figma"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-ibm-plex-mono"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "helium-browser"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "legcord"
cask "middleclick"
cask "onyx"
cask "opencode-desktop"
cask "raycast"
cask "slack"
cask "tailscale-app"
cask "visual-studio-code"
cask "zed"
cask "zen"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-theme"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "jakebecker.elixir-ls"
vscode "jdinhlife.gruvbox"
vscode "keksiqc.idx-monospace-theme"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "phoenixframework.phoenix"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
